In [119]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn import metrics

In [129]:

cal_name = ['work_year','experience_level','employment_type','job_title','salary','salary_currency','salary_in_usd','employee_residence','remote_ratio','company_location','company_size']
data = pd.read_csv('salaries.csv', names=cal_name, header=None)
data.iloc[0:10]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,MI,FT,Data Science Consultant,100000,USD,100000,US,100,US,M
1,2023,MI,FT,Data Scientist,128750,USD,128750,US,0,US,M
2,2023,MI,FT,Data Scientist,79350,USD,79350,US,0,US,M
3,2023,MI,FT,Data Manager,60000,GBP,73391,GB,0,GB,M
4,2023,MI,FT,Data Manager,55000,GBP,67275,GB,0,GB,M
5,2023,SE,FT,Data Scientist,185900,USD,185900,US,0,US,M
6,2023,SE,FT,Data Scientist,129300,USD,129300,US,0,US,M
7,2023,SE,FT,Analytics Engineer,174000,USD,174000,US,100,US,M
8,2023,SE,FT,Analytics Engineer,134000,USD,134000,US,100,US,M
9,2023,MI,FT,Research Engineer,155000,USD,155000,US,0,US,M

In [121]:
feature_cols = ['experience_level','employment_type','job_title','salary_currency','employee_residence','company_location','company_size']
X = data[feature_cols]
Y = data['salary_in_usd']

In [122]:
from sklearn import preprocessing
label_encoder = preprocessing.LabelEncoder()
data['experience_level']= label_encoder.fit_transform(data['experience_level'])
data['employment_type']= label_encoder.fit_transform(data['employment_type'])
data['job_title']= label_encoder.fit_transform(data['job_title'])
data['salary_currency']= label_encoder.fit_transform(data['salary_currency'])
data['employee_residence']= label_encoder.fit_transform(data['employee_residence'])
data['company_location']= label_encoder.fit_transform(data['company_location'])
data['company_size']= label_encoder.fit_transform(data['company_size'])
print(data.head())

   work_year  experience_level  employment_type  job_title  salary
0       2023                 2                2         47  100000  \
1       2023                 2                2         52  128750
2       2023                 2                2         52   79350
3       2023                 2                2         41   60000
4       2023                 2                2         41   55000

   salary_currency  salary_in_usd  employee_residence  remote_ratio
0               19         100000                  75           100  \
1               19         128750                  75             0
2               19          79350                  75             0
3                7          73391                  29             0
4                7          67275                  29             0

   company_location  company_size
0                66             1
1                66             1
2                66             1
3                25             1
4                25             1

In [123]:
feature_cols = ['experience_level','employment_type','job_title','salary_currency','employee_residence','company_location','company_size']
X = data[feature_cols]
Y = data['salary_in_usd']

print(X)
print(Y)

      experience_level  employment_type  job_title  salary_currency
0                    2                2         47               19  \
1                    2                2         52               19
2                    2                2         52               19
3                    2                2         41                7
4                    2                2         41                7
...                ...              ...        ...              ...
4608                 3                2         52               19
4609                 2                2         90               19
4610                 0                2         52               19
4611                 0                0         18               19
4612                 3                2         50               11

      employee_residence  company_location  company_size
0                     75                66             1
1                     75                66             1
2                     75                66             1
3                     29                25             1
4                     29                25             1
...                  ...               ...           ...
4608                  75                66             0
4609                  75                66             0
4610                  75                66             2
4611                  75                66             0
4612                  40                35             0

[4613 rows x 7 columns]
0       100000
1       128750
2        79350
3        73391
4        67275
         ...
4608    412000
4609    151000
4610    105000
4611    100000
4612     94665
Name: salary_in_usd, Length: 4613, dtype: int64

In [124]:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.2, random_state=100)

In [125]:
clf_entropy = DecisionTreeClassifier(criterion = "entropy", max_depth = 8)

clf_entropy = clf_entropy.fit(X_train, Y_train)

In [ ]:
y_pred = clf_entropy.predict(X_test)

print("Accuracy:",metrics.accuracy_score(Y_test, y_pred))